DingDa-H/stm32f1_rtos/User/Ui/menu.h
/**
 * @brief 		二级菜单主页面导航
 * @version 	DingDa-H	
 * @data 		20260530	
 * @note 		我之前的代码被sb豆包搞的没了！！！好不容易找回部分，让ai给我补全的.h文件
 */

//#ifndef __MENU_H
//#define __MENU_H

//#include "stm32f1xx_hal.h"
//#include "project.h"

///**
// * @brief 		菜单选项的选中状态
// * @param 	
// * @data 			
// * @note 		
// */
//typedef enum
//{
//    emMenutextSelectStatus_Flase     = 0,                       // 0 未选中
//    emMenutextSelectStatus_True    	 = 1,                       // 1 选中
//}
//emMenutextSelectStatusTdf;

///**
// * @brief 		单行选择框数据结构
// * @param 		
// * @data 			
// * @note 		
// */
//typedef struct
//{
//	uint32_t 					x;							//起始x坐标
//	uint32_t					y;							//起始y坐标
//	uint8_t 					*ucData;					//要显示的字符串
//	emOledFontSizeTdf			emFontSize;					//字号大小
//	emMenutextSelectStatusTdf	emSelectStatus;				//选中状态	
//}
//stMenuItemTdf;


//void vMenu(void);
//void vMenuInit(void);
//void vShowWenuTextAll(void);
//#endif
#ifndef __MENU_H
#define __MENU_H

#include "stm32f1xx_hal.h"
#include "project.h"
#include "oled_device.h"
#include "ui_button.h"
#include "test.h"
// ===================== 宏定义 =====================
// 菜单一屏可见行数，和 menu.c 滚动逻辑对应
#define MENU_VISIBLE_LINES      4U

// ===================== 页面枚举 =====================
typedef enum
{
    emMenu = 0,                // 主菜单
    emMenu_Calculator,         // 计算器页面
    emMenu_LED,                // LED控制页面
    emMenu_SnakeGame,          // 贪吃蛇页面
    emMenu_SerialTest,         // 串口测试页面
} emAllMenuTdf;

// ===================== 菜单项选中状态枚举 =====================
typedef enum
{
    emMenutextSelectStatus_Flase  = 0,  // 未选中
    emMenutextSelectStatus_True   = 1   // 选中
} emMenutextSelectStatusTdf;

// ===================== 菜单项结构体 =====================
typedef struct
{
	uint32_t 					x;
	uint32_t					y;
	uint8_t 					*ucData;
	emOledFontSizeTdf			emFontSize;
	emMenutextSelectStatusTdf	emSelectStatus;
} stMenuItemTdf;

// ===================== 外部函数声明（全部补齐） =====================
void vMenuInit(void);
void vMenuSelectDown(void);
void vMenuSelectUp(void);
void vMenuEnter(void);
void vMenuCancel(void);
uint8_t ucGetMenuSelectedIndex(void);
void vShowMenuTextAll(void);
void vShowMenu(void);
void vShowCalculatorMenu(void);
void vShowLEDMenu(void);
void vCurrentPageShow(void);

// 获取当前页面
emAllMenuTdf emGetCurrentPage(void);

#endif